Repository: mezinster/nfcarchiver
Catalog: lib/l10n/app_*.arb
Languages: ka, ru, tr, uk

# appTitle
source: NFC Archiver
ka: NFC არქივატორი
ru: NFC Архиватор
tr: NFC Archivcisi
uk: NFC Архіватор

# nfcChecking
source: Checking NFC...
ka: NFC-ს შემოწმება...
ru: Проверка NFC...
tr: NFC kontrol ediliyor...
uk: Перевірка NFC...

# nfcAvailable
source: NFC is available
ka: NFC ხელმისაწვდომია
ru: NFC доступен
tr: NFC kullanılabilir
uk: NFC доступний

# nfcUnavailable
source: NFC is not available
ka: NFC მიუწვდომელია
ru: NFC недоступен
tr: NFC kullanılamıyor
uk: NFC недоступний

# mainHeading
source: Store files across multiple NFC tags
ka: შეინახეთ ფაილები რამდენიმე NFC ტეგზე
ru: Храните файлы на нескольких NFC-метках
tr: Dosyaları birden fazla NFC etiketinde saklayın
uk: Зберігайте файли на кількох NFC-мітках

source: Create Archive
ka: არქივის შექმნა
ru: Создать архив
tr: Arşiv Oluştur
uk: Створити архів

# createArchiveDesc
source: Split a file into multiple NFC tags
ka: ფაილის დაყოფა რამდენიმე NFC ტეგზე
ru: Разбить файл на несколько NFC-меток
tr: Bir dosyayı birden fazla NFC etiketine böl
uk: Розділити файл на кілька NFC-міток

source: Restore Archive
ka: არქივის აღდგენა
ru: Восстановить архив
tr: Arşivi Geri Yükle
uk: Відновити архів

# restoreArchiveDesc
source: Scan tags to restore a file
ka: ტეგების სკანირება ფაილის აღსადგენად
ru: Сканировать метки для восстановления файла
tr: Dosyayı geri yüklemek için etiketleri tara
uk: Сканувати мітки для відновлення файлу

# version
source: NFC Archiver (c) 2026
ka: NFC არქივატორი (c) 2026
ru: NFC Архиватор (c) 2026
tr: NFC Arşivcisi (c) 2026
uk: NFC Архіватор (c) 2026

# aboutAppDescription
source: A distributed data archive system using NFC tags. Store files across multiple NFC tags and restore them later.
ka: განაწილებული მონაცემთა არქივაციის სისტემა NFC ტეგების გამოყენებით. შეინახეთ ფაილები რამდენიმე NFC ტეგზე და აღადგინეთ ისინი მოგვიანებით.
ru: Распределённая система архивации данных с использованием NFC-меток. Храните файлы на нескольких NFC-метках и восстанавливайте их позже.
tr: NFC etiketleri kullanan dağıtık veri arşivleme sistemi. Dosyaları birden fazla NFC etiketinde saklayın ve daha sonra geri yükleyin.
uk: Розподілена система архівації даних з використанням NFC-міток. Зберігайте файли на кількох NFC-мітках та відновлюйте їх пізніше.

# aboutSupportedTags
source: Supported tags: NTAG213/215/216, MIFARE Ultralight
ka: მხარდაჭერილი ტეგები: NTAG213/215/216, MIFARE Ultralight
ru: Поддерживаемые метки: NTAG213/215/216, MIFARE Ultralight
tr: Desteklenen etiketler: NTAG213/215/216, MIFARE Ultralight
uk: Підтримувані мітки: NTAG213/215/216, MIFARE Ultralight

source: Select File
ka: ფაილის არჩევა
ru: Выбор файла
tr: Dosya Seç
uk: Вибір файлу

# tapToSelectFile
source: Tap to select a file
ka: შეეხეთ ფაილის ასარჩევად
ru: Нажмите для выбора файла
tr: Dosya seçmek için dokunun
uk: Натисніть для вибору файлу

# chooseFileToArchive
source: Choose any file to archive to NFC tags
ka: აირჩიეთ ნებისმიერი ფაილი NFC ტეგებზე არქივაციისთვის
ru: Выберите любой файл для архивации на NFC-метки
tr: NFC etiketlerine arşivlemek için herhangi bir dosya seçin
uk: Виберіть будь-який файл для архівації на NFC-мітки

source: Configure Archive
ka: არქივის კონფიგურაცია
ru: Настроить архив
tr: Arşivi Yapılandır
uk: Налаштувати архів

source: Could not access file
ka: ფაილზე წვდომა ვერ მოხერხდა
ru: Не удалось получить доступ к файлу
tr: Dosyaya erişilemedi
uk: Не вдалося отримати доступ до файлу

# errorSelectingFile
source: Error selecting file: {error}
ka: ფაილის არჩევის შეცდომა: {error}
ru: Ошибка при выборе файла: {error}
tr: Dosya seçme hatası: {error}
uk: Помилка вибору файлу: {error}

source: Settings
ka: პარამეტრები
ru: Настройки
tr: Ayarlar
uk: Налаштування

source: No file selected
ka: ფაილი არ არის არჩეული
ru: Файл не выбран
tr: Dosya seçilmedi
uk: Файл не вибрано

source: Archive Settings
ka: არქივის პარამეტრები
ru: Настройки архива
tr: Arşiv Ayarları
uk: Налаштування архіву

source: NFC Tag Type
ka: NFC ტეგის ტიპი
ru: Тип NFC-метки
tr: NFC Etiket Türü
uk: Тип NFC-мітки

# bytesCapacity
source: {bytes} bytes capacity
ka: {bytes} ბაიტი ტევადობა
ru: {bytes} байт ёмкость
tr: {bytes} bayt kapasite
uk: {bytes} байт ємність

source: Enable Compression
ka: შეკუმშვის ჩართვა
ru: Включить сжатие
tr: Sıkıştırmayı Etkinleştir
uk: Увімкнути стиснення

# compressionSubtitle
source: Reduce size with GZIP compression
ka: ზომის შემცირება GZIP შეკუმშვით
ru: Уменьшить размер с помощью GZIP
tr: GZIP sıkıştırma ile boyutu küçült
uk: Зменшити розмір за допомогою GZIP

source: Enable Encryption
ka: დაშიფვრის ჩართვა
ru: Включить шифрование
tr: Şifrelemeyi Etkinleştir
uk: Увімкнути шифрування

# encryptionSubtitle
source: Protect with AES-256-GCM
ka: დაცვა AES-256-GCM-ით
ru: Защитить с помощью AES-256-GCM
tr: AES-256-GCM ile koru
uk: Захистити за допомогою AES-256-GCM

source: Password
ka: პაროლი
ru: Пароль
tr: Şifre
uk: Пароль

# enterPassword
source: Enter encryption password
ka: შეიყვანეთ დაშიფვრის პაროლი
ru: Введите пароль для шифрования
tr: Şifreleme şifresini girin
uk: Введіть пароль для шифрування

# pleaseEnterPassword
source: Please enter a password
ka: გთხოვთ შეიყვანოთ პაროლი
ru: Пожалуйста, введите пароль
tr: Lütfen bir şifre girin
uk: Будь ласка, введіть пароль

source: Archive Estimate
ka: არქივის შეფასება
ru: Оценка архива
tr: Arşiv Tahmini
uk: Оцінка архіву

source: Original size
ka: ორიგინალური ზომა
ru: Исходный размер
tr: Orijinal boyut
uk: Початковий розмір

source: Estimated processed size
ka: სავარაუდო დამუშავებული ზომა
ru: Примерный размер после обработки
tr: Tahmini işlenmiş boyut
uk: Приблизний розмір після обробки

source: Tags needed
ka: საჭირო ტეგები
ru: Требуется меток
tr: Gereken etiket sayısı
uk: Потрібно міток

source: Payload per tag
ka: მონაცემები ტეგზე
ru: Данных на метку
tr: Etiket başına veri
uk: Даних на мітку

# bytesUnit
source: {bytes} bytes
ka: {bytes} ბაიტი
ru: {bytes} байт
tr: {bytes} bayt
uk: {bytes} байт

source: Start Archiving
ka: არქივაციის დაწყება
ru: Начать архивацию
tr: Arşivlemeyi Başlat
uk: Почати архівацію

source: Writing to Tags
ka: ტეგებზე ჩაწერა
ru: Запись на метки
tr: Etiketlere Yazılıyor
uk: Запис на мітки

source: Tag Too Small
ka: ტეგი ძალიან პატარაა
ru: Метка слишком мала
tr: Etiket Çok Küçük
uk: Мітка занадто мала

# tagTooSmallMessage
source: This tag has {available} bytes available, but the chunk needs {required} bytes.
ka: ამ ტეგზე ხელმისაწვდომია {available} ბაიტი, მაგრამ ნაწილისთვის საჭიროა {required} ბაიტი.
ru: На этой метке доступно {available} байт, но для чанка требуется {required} байт.
tr: Bu etikette {available} bayt mevcut, ancak parça için {required} bayt gerekiyor.
uk: На цій мітці доступно {available} байт, але для чанку потрібно {required} байт.

# reconfigureForTagSize
source: Would you like to reconfigure the archive for this tag size?
ka: გსურთ არქივის ხელახლა კონფიგურაცია ამ ტეგის ზომისთვის?
ru: Хотите перенастроить архив под размер этой метки?
tr: Arşivi bu etiket boyutuna göre yeniden yapılandırmak ister misiniz?
uk: Бажаєте переналаштувати архів під розмір цієї мітки?

# reconfigureDetails
source: This will split the data into {chunks} smaller chunks ({bytes} bytes each).
ka: მონაცემები დაიყოფა {chunks} პატარა ნაწილად (თითო {bytes} ბაიტი).
ru: Данные будут разбиты на {chunks} меньших чанков ({bytes} байт каждый).
tr: Bu, verileri {chunks} küçük parçaya ({bytes} bayt her biri) böler.
uk: Дані будуть розбиті на {chunks} менших чанків ({bytes} байт кожен).

# cannotReconfigureChunksWritten
source: Cannot reconfigure: chunks have already been written.
ka: ხელახლა კონფიგურაცია შეუძლებელია: ნაწილები უკვე ჩაწერილია.
ru: Невозможно перенастроить: чанки уже записаны.
tr: Yeniden yapılandırılamıyor: parçalar zaten yazıldı.
uk: Неможливо переналаштувати: чанки вже записані.

# tagTooSmallForData
source: This tag is too small to store any data.
ka: ეს ტეგი ძალიან პატარაა მონაცემების შესანახად.
ru: Эта метка слишком мала для хранения данных.
tr: Bu etiket herhangi bir veri depolamak için çok küçük.
uk: Ця мітка занадто мала для зберігання даних.

source: Use Different Tag
ka: სხვა ტეგის გამოყენება
ru: Использовать другую метку
tr: Farklı Etiket Kullan
uk: Використати іншу мітку

source: Reconfigure
ka: ხელახლა კონფიგურაცია
ru: Перенастроить
tr: Yeniden Yapılandır
uk: Переналаштувати

# reconfiguredNowUsingTags
source: Reconfigured: now using {count} tags
ka: ხელახლა კონფიგურირებულია: ახლა გამოიყენება {count} ტეგი
ru: Перенастроено: теперь используется {count} меток
tr: Yeniden yapılandırıldı: şimdi {count} etiket kullanılıyor
uk: Переналаштовано: тепер використовується {count} міток

# failedToReconfigure
source: Failed to reconfigure archive
ka: არქივის ხელახლა კონფიგურაცია ვერ მოხერხდა
ru: Не удалось перенастроить архив
tr: Arşiv yeniden yapılandırılamadı
uk: Не вдалося переналаштувати архів

source: Hold tag near device
ka: მიაახლოვეთ ტეგი მოწყობილობას
ru: Поднесите метку к устройству
tr: Etiketi cihaza yakın tutun
uk: Піднесіть мітку до пристрою

# readyToWriteTag
source: Ready to write tag {index}
ka: მზადაა ტეგის {index} ჩასაწერად
ru: Готов к записи метки {index}
tr: Etiket {index} yazmaya hazır
uk: Готовий до запису мітки {index}

# chunkOfTotal
source: Chunk {current} of {total}
ka: ნაწილი {current} / {total}
ru: Чанк {current} из {total}
tr: Parça {current} / {total}
uk: Чанк {current} з {total}

source: Write to Tag
ka: ტეგზე ჩაწერა
ru: Записать на метку
tr: Etikete Yaz
uk: Записати на мітку

source: Cancel
ka: გაუქმება
ru: Отмена
tr: İptal
uk: Скасувати

source: Skip this tag
ka: ამ ტეგის გამოტოვება
ru: Пропустить эту метку
tr: Bu etiketi atla
uk: Пропустити цю мітку

# writingChunk
source: Writing chunk {index}...
ka: ნაწილის {index} ჩაწერა...
ru: Запись чанка {index}...
tr: Parça {index} yazılıyor...
uk: Запис чанку {index}...

source: Tag Written!
ka: ტეგი ჩაწერილია!
ru: Метка записана!
tr: Etiket Yazıldı!
uk: Мітку записано!

# removeTagFromDevice
source: Remove the tag from your device
ka: მოაშორეთ ტეგი მოწყობილობას
ru: Уберите метку от устройства
tr: Etiketi cihazdan uzaklaştırın
uk: Приберіть мітку від пристрою

# bytesWritten
source: {bytes} bytes written
ka: ჩაწერილია {bytes} ბაიტი
ru: Записано {bytes} байт
tr: {bytes} bayt yazıldı
uk: Записано {bytes} байт

# continueButton
source: Continue
ka: გაგრძელება
ru: Продолжить
tr: Devam
uk: Продовжити

source: Archive Complete!
ka: არქივაცია დასრულებულია!
ru: Архивация завершена!
tr: Arşivleme Tamamlandı!
uk: Архівацію завершено!

# tagsWritten
source: {count} tags written
ka: ჩაწერილია {count} ტეგი
ru: Записано меток: {count}
tr: {count} etiket yazıldı
uk: Записано міток: {count}

source: Done
ka: დასრულება
ru: Готово
tr: Tamam
uk: Готово

source: Error
ka: შეცდომა
ru: Ошибка
tr: Hata
uk: Помилка

source: Try Again
ka: ხელახლა ცდა
ru: Попробовать снова
tr: Tekrar Dene
uk: Спробувати знову

source: Unexpected state
ka: მოულოდნელი მდგომარეობა
ru: Неожиданное состояние
tr: Beklenmeyen durum
uk: Неочікуваний стан

source: Cancel Archive?
ka: არქივაციის გაუქმება?
ru: Отменить архивацию?
tr: Arşivleme İptal Edilsin mi?
uk: Скасувати архівацію?

# progressWillBeLost
source: Progress will be lost. Are you sure you want to cancel?
ka: პროგრესი დაიკარგება. დარწმუნებული ხართ, რომ გსურთ გაუქმება?
ru: Прогресс будет потерян. Вы уверены, что хотите отменить?
tr: İlerleme kaybolacak. İptal etmek istediğinizden emin misiniz?
uk: Прогрес буде втрачено. Ви впевнені, що хочете скасувати?

source: Progress
ka: პროგრესი
ru: Прогресс
tr: İlerleme
uk: Прогрес

# tagsProgress
source: {current} / {total} tags
ka: {current} / {total} ტეგი
ru: {current} / {total} меток
tr: {current} / {total} etiket
uk: {current} / {total} міток

# holdTagNearDeviceToWrite
source: Hold tag near device to write chunk {current} of {total}
ka: მიაახლოვეთ ტეგი მოწყობილობას ნაწილის {current} / {total} ჩასაწერად
ru: Поднесите метку к устройству для записи чанка {current} из {total}
tr: Parça {current} / {total} yazmak için etiketi cihaza yakın tutun
uk: Піднесіть мітку до пристрою для запису чанку {current} з {total}

source: Scan Tags
ka: ტეგების სკანირება
ru: Сканирование меток
tr: Etiketleri Tara
uk: Сканування міток

source: Scanning for tags...
ka: ტეგების ძიება...
ru: Поиск меток...
tr: Etiketler taranıyor...
uk: Пошук міток...

source: Preparing scanner...
ka: სკანერის მომზადება...
ru: Подготовка сканера...
tr: Tarayıcı hazırlanıyor...
uk: Підготовка сканера...

# holdEachTagNear
source: Hold each NFC tag near your device
ka: მიაახლოვეთ თითოეული NFC ტეგი მოწყობილობას
ru: Поднесите каждую NFC-метку к устройству
tr: Her NFC etiketini cihazınıza yakın tutun
uk: Піднесіть кожну NFC-мітку до пристрою

# holdDeviceNearTag
source: Hold your device near an NFC tag
ka: მიაახლოვეთ მოწყობილობა NFC ტეგს
ru: Поднесите устройство к NFC-метке
tr: Cihazınızı NFC etiketine yakın tutun
uk: Піднесіть пристрій до NFC-мітки

source: New chunk found!
ka: ნაპოვნია ახალი ნაწილი!
ru: Найден новый чанк!
tr: Yeni parça bulundu!
uk: Знайдено новий чанк!

source: Duplicate chunk
ka: დუბლიკატი ნაწილი
ru: Дубликат чанка
tr: Yinelenen parça
uk: Дублікат чанку

source: Archives in progress
ka: მიმდინარე არქივები
ru: Архивы в процессе
tr: Devam eden arşivler
uk: Архіви в процесі

source: Archive {id}...
ka: არქივი {id}...
ru: Архив {id}...
tr: Arşiv {id}...
uk: Архів {id}...

source: All chunks received!
ka: ყველა ნაწილი მიღებულია!
ru: Все чанки получены!
tr: Tüm parçalar alındı!
uk: Усі чанки отримано!

# chunksFromArchive
source: {count} chunks from archive
ka: {count} ნაწილი არქივიდან
ru: {count} чанков из архива
tr: Arşivden {count} parça
uk: {count} чанків з архіву

source: File name
ka: ფაილის სახელი
ru: Имя файла
tr: Dosya adı
uk: Ім'я файлу

# fileNameHint
source: Leave default to use original filename
ka: დატოვეთ ნაგულისხმევი ორიგინალური სახელის გამოსაყენებლად
ru: Оставьте по умолчанию для использования оригинального имени
tr: Orijinal dosya adını kullanmak için varsayılanı bırakın
uk: Залиште за замовчуванням для використання оригінального імені

# fileNameHelper
source: Original filename will be used if available
ka: გამოყენებული იქნება ორიგინალური ფაილის სახელი, თუ ხელმისაწვდომია
ru: Будет использовано оригинальное имя файла, если доступно
tr: Mevcut ise orijinal dosya adı kullanılacak
uk: Буде використано оригінальне ім'я файлу, якщо доступне

# archiveIsEncrypted
source: This archive is encrypted
ka: ეს არქივი დაშიფრულია
ru: Этот архив зашифрован
tr: Bu arşiv şifrelenmiş
uk: Цей архів зашифровано

source: Enter decryption password
ka: შეიყვანეთ გაშიფვრის პაროლი
ru: Введите пароль для расшифровки
tr: Şifre çözme şifresini girin
uk: Введіть пароль для розшифрування

# charactersCount
source: {count} characters
ka: {count} სიმბოლო
ru: {count} символов
tr: {count} karakter
uk: {count} символів

source: Scan more tags
ka: მეტი ტეგის სკანირება
ru: Сканировать ещё метки
tr: Daha fazla etiket tara
uk: Сканувати ще мітки

source: Archive Restored!
ka: არქივი აღდგენილია!
ru: Архив восстановлен!
tr: Arşiv Geri Yüklendi!
uk: Архів відновлено!

# savedTo
source: Saved to: {path}
ka: შენახულია: {path}
ru: Сохранено в: {path}
tr: Kaydedildi: {path}
uk: Збережено в: {path}

source: Share File
ka: ფაილის გაზიარება
ru: Поделиться файлом
tr: Dosyayı Paylaş
uk: Поділитися файлом

source: Data Corruption Detected
ka: აღმოჩენილია მონაცემთა დაზიანება
ru: Обнаружено повреждение данных
tr: Veri Bozulması Tespit Edildi
uk: Виявлено пошкодження даних

source: Restore Failed
ka: აღდგენა ვერ მოხერხდა
ru: Ошибка восстановления
tr: Geri Yükleme Başarısız
uk: Помилка відновлення

# rescanTags
source: Rescan {count} Tag(s)
ka: {count} ტეგის ხელახლა სკანირება
ru: Пересканировать {count} метку(и)
tr: {count} Etiketi Yeniden Tara
uk: Пересканувати {count} мітку(и)

source: Try Different Password
ka: სხვა პაროლის ცდა
ru: Попробовать другой пароль
tr: Farklı Şifre Dene
uk: Спробувати інший пароль

source: Please enter the password
ka: გთხოვთ შეიყვანოთ პაროლი
ru: Пожалуйста, введите пароль
tr: Lütfen şifreyi girin
uk: Будь ласка, введіть пароль

source: English
ka: ინგლისური
ru: Английский
tr: İngilizce
uk: Англійська

source: Russian
ka: რუსული
ru: Русский
tr: Rusça
uk: Російська

source: Language
ka: ენა
ru: Язык
tr: Dil
uk: Мова

source: File
ka: ფაილი
ru: Файл
tr: Dosya
uk: Файл

source: Text
ka: ტექსტი
ru: Текст
tr: Metin
uk: Текст

source: Enter text to archive
ka: შეიყვანეთ ტექსტი არქივაციისთვის
ru: Введите текст для архивации
tr: Arşivlenecek metni girin
uk: Введіть текст для архівації

source: Type your text here...
ka: აკრიფეთ ტექსტი აქ...
ru: Введите текст здесь...
tr: Metninizi buraya yazın...
uk: Введіть текст тут...

source: Text Restored!
ka: ტექსტი აღდგენილია!
ru: Текст восстановлен!
tr: Metin Geri Yüklendi!
uk: Текст відновлено!

# textCopied
source: Text copied to clipboard
ka: ტექსტი კოპირებულია ბუფერში
ru: Текст скопирован в буфер обмена
tr: Metin panoya kopyalandı
uk: Текст скопійовано до буфера обміну

source: Copy text
ka: ტექსტის კოპირება
ru: Копировать текст
tr: Metni kopyala
uk: Копіювати текст

source: [Could not decode text]
ka: [ტექსტის გაშიფვრა ვერ მოხერხდა]
ru: [Не удалось декодировать текст]
tr: [Metin çözülemedi]
uk: [Не вдалося декодувати текст]
